README.org
#+PROPERTY: header-args :tangle yes :noweb yes :results silent
#+STARTUP: overview

* Introduction
Hi there! That's my dotfiles.

This repository contains configuration for three hosts:
- omicron — my main laptop which runs NixOS
- pie — my home server RPi running NixOS (see [[./pie.org][pie.org]])

Most of config files are generated by [[http://orgmode.org/worg/org-contrib/babel/][org-babel]] from org files in this repository (yes, including this very same ~README.org~). That's [[https://en.wikipedia.org/wiki/Literate_programming][literate programming]] applied to dotfiles.

This file contains Emacs configuration, NixOS and home-manager configuration for omicron.

[[./pie.org][pie.org]] is a separate NixOS config for pie host.

To generate actual nix files, you can open this file in Emacs, and execute =M-x org-babel-tangle=. Or from command line with the following command.

#+begin_src sh :tangle no
emacs README.org --batch -f org-babel-tangle
#+end_src

#+RESULTS:

Note that you need to patch org-babel to correctly generate configs (<<patch-ob-tangle>>)

I keep generated files in sync with org files (so this repo is a valid Nix Flake), but they are not worth looking at—you'll have much better time reading this doc instead.

Pieces not (yet) covered in org files are:
- scripts at =bin/=

* Top-level
** Flake
This repository is nix flakes–compatible.

The following goes to ~flake.nix~ file.
#+begin_src nix :tangle flake.nix :noweb no-export :padline no
#
# This file is auto-generated from "README.org"
#
{
  description = "rasendubi's packages and NixOS/home-manager configurations";

  inputs = {
    nixpkgs = {
      type = "github";
      owner = "NixOS";
      repo = "nixpkgs";
      ref = "nixos-25.05";
    };

    <<flake-inputs>>
  };

  outputs = { self, ... }@inputs:
    let
      # Flakes are evaluated hermetically, thus are unable to access
      # host environment (including looking up current system).
      #
      # That's why flakes must explicitly export sets for each system
      # supported.
      systems = ["x86_64-linux" "aarch64-linux" "aarch64-darwin"];

      # genAttrs applies f to all elements of a list of strings, and
      # returns an attrset { name -> result }
      #
      # Useful for generating sets for all systems or hosts.
      genAttrs = list: f: inputs.nixpkgs.lib.genAttrs list f;

      # Generate pkgs set for each system. This takes into account my
      # nixpkgs config (allowUnfree) and my overlays.
      pkgsBySystem =
        let mkPkgs = system: import inputs.nixpkgs {
              inherit system;
              overlays = self.overlays.${system};
              config = {
                allowUnfree = true;
                input-fonts.acceptLicense = true;
              };
            };
        in genAttrs systems mkPkgs;

      # genHosts takes an attrset { name -> options } and calls mkHost
      # with options+name. The result is accumulated into an attrset
      # { name -> result }.
      #
      # Used in NixOS and Home Manager configurations.
      genHosts = hosts: mkHost:
        genAttrs (builtins.attrNames hosts) (name: mkHost ({ inherit name; } // hosts.${name}));

      # merges a list of attrsets into a single attrset
      mergeSections = inputs.nixpkgs.lib.foldr inputs.nixpkgs.lib.mergeAttrs {};

    in mergeSections [
      <<flake-outputs-nixos>>
      <<flake-outputs-home-manager>>
      <<flake-outputs-packages>>
      <<flake-outputs-overlays>>
      <<flake-outputs-nix-darwin>>
    ];
}
#+end_src

Nix flakes are still an experimental feature, so you need the following in NixOS configuration to enable it.
#+name: nixos-section
#+begin_src nix
{
  nix = {
    extraOptions = ''
      experimental-features = nix-command flakes
    '';
  };
}
#+end_src

For nix-darwin systems:
#+name: darwin-section
#+begin_src nix
{
  nix = {
    extraOptions = ''
      experimental-features = nix-command flakes
    '';
  };
}
#+end_src

For non-NixOS system, put the following into =~/.config/nix/nix.conf=.
#+begin_src conf :tangle no
experimental-features = nix-command flakes
#+end_src

** Unstable packages
For packages that are not available in latest stable, expose the unstable channel as ~pkgs.unstable~.

Add input:
#+name: flake-inputs
#+begin_src nix
nixpkgs-unstable = {
  type = "github";
  owner = "NixOS";
  repo = "nixpkgs";
  ref = "nixpkgs-unstable";
};
#+end_src

Add overlay:
#+name: flake-overlays
#+begin_src nix
(final: prev: {
  unstable = import inputs.nixpkgs-unstable {
    inherit system;
    overlays = self.overlays.${system};
    config = { allowUnfree = true; };
  };
})
#+end_src
** NixOS
Expose NixOS configurations.
#+name: flake-outputs-nixos
#+begin_src nix
(let
  nixosHosts = {
    omicron = { system = "x86_64-linux";  config = ./nixos-config.nix; };

    # pie uses a separate config as it is very different
    # from other hosts.
    pie =     { system = "aarch64-linux"; config = ./pie.nix; };
  };

  mkNixosConfiguration = { name, system, config }:
    let pkgs = pkgsBySystem.${system};
    in inputs.nixpkgs.lib.nixosSystem {
      inherit system;
      modules = [
        { nixpkgs = { inherit pkgs; }; }
        (import config)
      ];
      specialArgs = { inherit name inputs; };
    };

in {
  nixosConfigurations = genHosts nixosHosts mkNixosConfiguration;
})
#+end_src
** Home manager
Add home-manager to flake inputs.
#+name: flake-inputs
#+begin_src nix
home-manager = {
  type = "github";
  owner = "rycee";
  repo = "home-manager";
  ref = "release-25.05";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

Expose home-manager configurations.
#+name: flake-outputs-home-manager
#+begin_src nix
(let
  homeManagerHosts = {
  };

  mkHomeManagerConfiguration = { system, name, config, username, homeDirectory }:
    let pkgs = pkgsBySystem.${system};
    in inputs.home-manager.lib.homeManagerConfiguration {
      inherit system pkgs username homeDirectory;
      configuration = { lib, ... }: {
        nixpkgs.config.allowUnfree = true;
        nixpkgs.config.firefox.enableTridactylNative = true;
        nixpkgs.overlays = self.overlays.${system};
        imports = [
          self.lib.home-manager-common

          (import config)
        ];
      };
    };

in {
  # Re-export common home-manager configuration to be reused between
  # NixOS module and standalone home-manager config.
  lib.home-manager-common = { name, lib, pkgs, config, ... }: {
    imports = [
      <<home-manager-section>>
    ];
    home.stateVersion = "21.05";
  };
  homeManagerConfigurations = genHosts homeManagerHosts mkHomeManagerConfiguration;
})
#+end_src

#+name: home-manager-section
#+begin_src nix
{
  options.hostname = lib.mkOption {
    default = null;
    type = lib.types.nullOr lib.types.str;
    description = "hostname so that other home-manager options can depend on it.";
  };
}
#+end_src

Integrate home-manager module into NixOS.
#+name: nixos-section
#+begin_src nix
{
  imports = [inputs.home-manager.nixosModules.home-manager];
  home-manager = {
    useUserPackages = true;
    useGlobalPkgs = true;
    users.rasen = inputs.self.lib.home-manager-common;
  };
}
#+end_src

Integrate home-manager into nix-darwin.
#+name: darwin-section
#+begin_src nix
{
  imports = [inputs.home-manager.darwinModules.home-manager];
  home-manager = {
    useUserPackages = false;
    useGlobalPkgs = true;
    users."${config.system.primaryUser}" = { ... }: {
      imports = [
        inputs.self.lib.home-manager-common
        { hostname = config.networking.hostName; }
      ];
    };
    # users.rasen = inputs.self.lib.home-manager-common;
  };
}
#+end_src

** nix-darwin
Add nix-darwin to flake inputs.
#+name: flake-inputs
#+begin_src nix
darwin = {
  url = "github:lnl7/nix-darwin/nix-darwin-25.05";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

Add helper function to differentiate linux-only config:
#+name: flake-overlays
#+begin_src nix
(final: prev: {
  lib = prev.lib // {
    linux-only = prev.lib.mkIf final.stdenv.isLinux;
  };
})
#+end_src

#+name: flake-outputs-nix-darwin
#+begin_src nix
(let
  darwinHosts = {
    <<darwin-host>>
  };

  mkDarwinConfiguration = { name, system, systemStateVersion, homeManagerStateVersion, primaryUser ? "rasen", modules ? [] }:
    inputs.darwin.lib.darwinSystem {
      inherit system;
      modules = modules ++ [
        {
          networking.hostName = name;
          system.primaryUser = primaryUser;
          system.stateVersion = systemStateVersion;
          home-manager.sharedModules = [
            ({lib, ...}: {
              home.stateVersion = lib.mkForce homeManagerStateVersion;
            })
          ];
        }
        self.darwin-common
      ];
    };

in {
  darwin-common = { lib, pkgs, config, ... }: {
    imports = [
      <<darwin-section>>
    ];
  };

  darwinConfigurations = genHosts darwinHosts mkDarwinConfiguration;
})
#+end_src

#+name: darwin-section
#+begin_src nix
{
  nixpkgs.config = {
    allowUnfree = true;
  };
  nixpkgs.overlays = self.overlays.aarch64-darwin;
}
#+end_src

And enable this in home-manager ([[https://github.com/nix-community/home-manager/blob/master/modules/targets/darwin/linkapps.nix][home-manager/linkapps.nix at master · nix-community/home-manager · GitHub]]):
#+name: home-manager-section
#+begin_src nix
({ config, lib, pkgs, ... }:

{
  config = lib.mkIf pkgs.stdenv.hostPlatform.isDarwin {
    # Install MacOS applications to the user environment.
    home.file."Applications/Home Manager Apps".source = let
      apps = pkgs.buildEnv {
        name = "home-manager-applications";
        paths = config.home.packages;
        pathsToLink = "/Applications";
      };
    in "${apps}/Applications";
  };
})
#+end_src
** Packages
Generate packages set for each supported system.
#+name: flake-outputs-packages
#+begin_src nix
(let
  mkPackages = system:
    let
      pkgs = pkgsBySystem.${system};
    in
      mergeSections [
        <<flake-packages>>
      ];

in {
  packages = genAttrs systems mkPackages;
})
#+end_src
** Overlays
Generate overlays for all supported systems.
#+name: flake-outputs-overlays
#+begin_src nix
(let
  mkOverlays = system: [
    # mix-in all local packages, so they are available as pkgs.${packages-name}
    (final: prev: self.packages.${system})

    <<flake-overlays>>
  ];
in {
  overlays = genAttrs systems mkOverlays;
})
#+end_src

~<<flake-overlays>>~ are defined elsewhere.
* NixOS
** General
I'm a [[http://nixos.org/][NixOS]] user. What's cool about it is that I can describe all my system configuration in one file (almost). I can execute a single command and have a system with the same software, system settings, etc.

An outline of configuration looks like this:

#+begin_src nix :tangle nixos-config.nix :noweb no-export :padline no
#
# This file is auto-generated from "README.org"
#
{ name, config, pkgs, lib, inputs, ... }:
let
  machine-config = lib.getAttr name {
    omicron = [
      <<machine-omicron>>
    ];
  };

in
{
  imports = [
    {
      # The NixOS release to be compatible with for stateful data such as databases.
      # TODO: make it per-machine
      system.stateVersion = "21.05";
    }

    <<nixos-section>>
  ] ++ machine-config;
}
#+end_src

This =<<nixos-section>>= is replaced by other parts of this doc.

** Re-expose nixpkgs
#+name: nixos-section
#+begin_src nix
{
  # for compatibility with nix-shell, nix-build, etc.
  environment.etc.nixpkgs.source = inputs.nixpkgs;
  nix.nixPath = ["nixpkgs=/etc/nixpkgs"];

  # register self and nixpkgs as flakes for quick access
  nix.registry = {
    self.flake = inputs.self;

    nixpkgs.flake = inputs.nixpkgs;
  };
}
#+end_src

Same but for Home Manager–managed host.
#+name: home-manager-section
#+begin_src nix
{
  home.file."nixpkgs".source = inputs.nixpkgs;
  systemd.user.sessionVariables.NIX_PATH = pkgs.lib.linux-only (lib.mkForce "nixpkgs=$HOME/nixpkgs\${NIX_PATH:+:}$NIX_PATH");

  xdg.configFile."nix/registry.json".text = builtins.toJSON {
    version = 2;
    flakes = [
      {
        from = { id = "self"; type = "indirect"; };
        to = ({
          type = "path";
          path = inputs.self.outPath;
        } // lib.filterAttrs
          (n: v: n == "lastModified" || n == "rev" || n == "revCount" || n == "narHash")
          inputs.self);
      }
      {
        from = { id = "nixpkgs"; type = "indirect"; };
        to = ({
          type = "path";
          path = inputs.nixpkgs.outPath;
        } // lib.filterAttrs
          (n: v: n == "lastModified" || n == "rev" || n == "revCount" || n == "narHash")
          inputs.nixpkgs);
      }
    ];
  };
}
#+end_src
** Sandbox
Build all packages in sandbox:
#+name: nixos-section
#+begin_src nix
{
  nix.settings.sandbox = true;
}
#+end_src
** Users
I'm the only user of the system:

#+name: nixos-section
#+begin_src nix
{
  users.extraUsers.rasen = {
    isNormalUser = true;
    uid = 1000;
    extraGroups = [ "users" "wheel" ];
    initialPassword = "HelloWorld";
  };
  nix.settings.trusted-users = ["rasen"];
}
#+end_src

=initialPassword= is used only first time when user is created. It must be changed as soon as possible with =passwd=.

** Machines
* macOS
** Users
#+name: darwin-section
#+begin_src nix
{
  users.users.${config.system.primaryUser} = {
    description = "Oleksii Shmalko";
    home = "/Users/${config.system.primaryUser}/";
  };
}
#+end_src
** Some defaults
#+name: darwin-section
#+begin_src nix
{
  system.defaults = {
    NSGlobalDomain = {
      # auto switch light/dark mode
      AppleInterfaceStyleSwitchesAutomatically = true;

      # disable automatic capitalization
      NSAutomaticCapitalizationEnabled = false;

      # Use F1, F2, etc keys by default (without needing to press fn)
      "com.apple.keyboard.fnState" = true;

      # disable beeps
      "com.apple.sound.beep.volume" = 0.0;

      # Disable natural scrolling
      "com.apple.swipescrolldirection" = false;
    };

    dock = {
      # Auto-hide dock
      autohide = true;
    };

    finder = {
      # Show extensions in finder
      AppleShowAllExtensions = true;
      # Prefer list view
      FXPreferredViewStyle = "Nlsv";
      # Open home directory by default
      NewWindowTarget = "Home";
      # Show pathbar
      ShowPathbar = true;
    };

    # Disable default fn keyboard layout switch. I have my own with Karabiner
    hitoolbox.AppleFnUsageType = "Do Nothing";

    # Show seconds in clock
    menuExtraClock.ShowSeconds = true;
  };

  system.keyboard = {
    enableKeyMapping = true;
    # Move tilde back on non-US keyboards
    nonUS.remapTilde = true;
    # Remap caps lock to control
    remapCapsLockToControl = true;
  };
}
#+end_src
** xbar integration function
#+begin_src emacs-lisp
(defun rasen/xbar (base &optional arg)
  "Return a string for xbar plugin integration or perform the action."
  ;; (message "(rasen/xbar %S %S)" base arg)
  (pcase arg
    ('clock-out (org-clock-out))
    ('clock-in-last (org-clock-in-last))

    ('nil (if (org-clock-is-active)
              (concat
               (format "[%s] %s | length=50\n" (org-duration-from-minutes (org-clock-get-clocked-time)) org-clock-heading)
               "---\n"
               (format "Clock out | shell=%s | param1=clock-out\n" base))

            (concat
             (format "not clocking %s | color=gray | size=12\n"
                     (cond
                      (break--work-timer (format "w:%s" (break--timer-to-string break--work-timer)))
                      (break--rest-timer (format "r:%s" (break--timer-to-string break--rest-timer)))
                      (t "")))
             "---\n"
             (format "Clock in last | shell=%s | param1=clock-in-last\n" base))))))
#+end_src

org-clock.1s.sh
#+begin_src sh
#!/usr/bin/env bash
~/.nix-profile/bin/emacs --batch --eval "(progn (require 'server) (princ (server-eval-at \"server\" '(rasen/xbar \"$0\"${1:+" '$1"}))))"
#+end_src
