.emacs.d/early-init.el
;;;
;;; This file is auto-generated from "README.org"
;;;

(setq gc-cons-threshold most-positive-fixnum)
(add-hook 'emacs-startup-hook (defun rasen/restore-gc-threshold ()
                                (setq gc-cons-threshold 800000)))

(require 'package)
(setq package-archives nil)
(setq package-enable-at-startup nil)

(tool-bar-mode -1)
(menu-bar-mode -1)
