README.org
*** JavaScript
#+begin_src emacs-lisp
(use-package js2-mode
  :mode "\\.js$"
  :init
  (add-hook 'js2-mode-hook 'color-identifiers-mode)
  :config

  (defun rasen/use-eslint-from-node-modules ()
    (let* ((root (locate-dominating-file
                  (or (buffer-file-name) default-directory)
                  "node_modules"))
           (eslint (and root
                        (expand-file-name "node_modules/eslint/bin/eslint.js"
                                          root))))
      (when (and eslint (file-executable-p eslint))
        (setq-local flycheck-javascript-eslint-executable eslint))))
  (add-hook 'flycheck-mode-hook #'rasen/use-eslint-from-node-modules)

  (add-hook 'js2-mode-hook
            (lambda ()
              (flycheck-select-checker 'javascript-eslint)))

  (setq-default flycheck-disabled-checkers
                (append flycheck-disabled-checkers
                        '(javascript-jshint)))
  (setq-default flycheck-enabled-checkers
                (append flycheck-enabled-checkers
                        '(javascript-eslint)))

  (flycheck-add-mode 'javascript-eslint 'js2-mode)

  (setq-default js2-strict-trailing-comma-warning nil))

(use-package rjsx-mode
  :mode "\\.js$"
  :config
  (setq-default js-indent-level 2))
#+end_src

*** Create writable npm global directory
#+name: home-manager-section
#+begin_src nix
{
  home.sessionVariables.npm_config_prefix = "$HOME/.npm-global";
  home.sessionPath = ["$HOME/.npm-global/bin"];
}
#+end_src
*** Typescript
#+begin_src emacs-lisp
(use-package typescript-mode
  :commands (typescript-mode)
  :gfhook
  #'rasen/setup-tide-mode
  #'abbrev-mode
  :init
  (el-patch-feature typescript-mode)
  (add-hook 'web-mode-hook
            (defun rasen/enable-typescript ()
              (when (member (file-name-extension buffer-file-name)
                            '("ts" "tsx" "js" "jsx"))
                (typescript-mode))))
  (add-hook 'rjsx-mode-hook #'rasen/enable-typescript)
  :general
  ('insert
   'typescript-mode-map
   "M-j"   #'c-indent-new-comment-line
   "C-M-j" #'c-indent-new-comment-line)
  :config
  (setq-default typescript-indent-level 2)

  ;; Add more jsdoc tags
  (el-patch-defconst typescript-jsdoc-empty-tag-regexp
    (concat typescript-jsdoc-before-tag-regexp
            "\\(@"
            (regexp-opt
             '("abstract"
               "addon"
               "async"
               "author"
               "class"
               "classdesc"
               "const"
               "constant"
               "constructor"
               "constructs"
               "copyright"
               "default"
               "defaultvalue"
               "deprecated"
               "desc"
               "description"
               "event"
               "example"
               "exec"
               "export"
               "exports"
               "file"
               "fileoverview"
               "final"
               "func"
               "function"
               "generator"
               "global"
               "hidden"
               "hideconstructor"
               "ignore"
               "implicitcast"
               "inheritdoc"
               "inner"
               "instance"
               "interface"
               "license"
               "method"
               "mixin"
               "noalias"
               "noshadow"
               "notypecheck"
               "override"
               "overview"
               "owner"
               "package"
               "preserve"
               "preservetry"
               "private"
               "protected"
               "public"
               "readonly"
               "static"
               "summary"
               "supported"
               "todo"
               "tutorial"
               "virtual"
               (el-patch-add
                 "remarks"
                 "alpha"
                 "beta"
                 "defaultValue"
                 "eventProperty"
                 "example"
                 "experimental"
                 "inheritDoc"
                 "internal"
                 "label"
                 "link"
                 "packageDocumentation"
                 "privateRemarks"
                 "sealed"
                 "typeParam")))
            "\\)\\s-*")
    "Matches empty jsdoc tags."))
#+end_src

#+begin_src emacs-lisp
(use-package tide
  :commands (tide-setup
             tide-hl-identifier-mode
             tide-format-before-save)
  :hook
  (typescript-mode . rasen/setup-tide-mode)
  :init
  (defun rasen/setup-tide-mode ()
    (interactive)
    (with-demoted-errors "tide-setup: %S"
      (tide-setup))
    (flycheck-mode +1)
    (setq flycheck-check-syntax-automatically '(save mode-enabled))
    (eldoc-mode +1)
    (tide-hl-identifier-mode +1)
    (company-mode +1))
  :config
  ;; K is used for avy
  (general-def 'normal 'tide-mode-map
    "K" nil))
#+end_src

#+begin_src emacs-lisp
(use-package prettier-js
  :commands (prettier-js prettier-js-mode)
  :hook
  (typescript-mode . prettier-js-mode))
#+end_src

#+begin_src emacs-lisp
(use-package flycheck-jest
  :after flycheck)
#+end_src
*** Svelte
#+begin_src emacs-lisp
(use-package svelte-mode
  :mode "\\.svelte$"
  :gfhook #'prettier-js-mode
  :config
  (setq svelte-basic-offset 2))
#+end_src
*** Vue
#+begin_src emacs-lisp
(use-package vue-mode
  :mode "\\.vue$")
#+end_src
*** Web-mode
#+begin_src emacs-lisp
(use-package web-mode
  :commands (web-mode)
  :init
  (add-to-list 'auto-mode-alist '("\\.blade.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.ts\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tsx\\'" . web-mode))
  :config
  (setq web-mode-engines-alist
        '(("php"    . "\\.phtml\\'")
          ("blade"  . "\\.blade\\."))))
#+end_src
*** Clojure(Script)
#+begin_src emacs-lisp
(use-package clojure-mode
  :mode "\\.\\(clj\\|cljs\\)$")

(use-package cider
  :after clojure-mode
  :config
  (evil-set-initial-state 'cider-stacktrace-mode 'emacs))
#+end_src
*** Groovy
#+begin_src emacs-lisp
(use-package groovy-mode
  :mode "\\.\\(groovy\\|gradle\\)$")
#+end_src
*** Kotlin
#+begin_src emacs-lisp
(use-package kotlin-mode
  :mode "\\.kt'")
#+end_src
*** Forth
#+begin_src emacs-lisp
(use-package forth-mode
  :config
  (defun rasen/disable-electric-pair ()
    (interactive)
    (electric-pair-local-mode -1))
  (add-hook 'forth-mode-hook #'rasen/disable-electric-pair))
#+end_src
*** Lua
#+begin_src emacs-lisp
(use-package lua-mode
  :mode ("\\.lua$" . lua-mode)
  :config
  (require 'eglot)
  (push '(lua-mode "lua-language-server") eglot-server-programs)
  ;; (push '(lua-mode . ("fmtk" "lsp" "--stdio")) eglot-server-programs)
  (setq eglot-events-buffer-size 0) ; Without this, lua-language-server is super-laggy
  (setq lua-indent-level 4)
  (add-hook 'lua-mode-hook (defun rasen/lua-set-format-on-save-hook ()
                             ;; Set eglot indentation
                             (add-hook 'write-contents-functions
                                       (defun rasen/lua-format-on-save ()
                                         (ignore-errors
                                           (eglot-format-buffer))
                                         nil))
                             (setq-local tab-width 4))))
#+end_src
*** Ledger / Hledger
#+begin_src emacs-lisp
(use-package ledger-mode
  :mode "\\.journal$"
  :config
  (setq ledger-binary-path "hledger")
  (add-hook 'ledger-mode-hook 'orgstruct-mode))
#+end_src
*** Markdown
#+begin_src emacs-lisp
(use-package markdown-mode
  :mode ("\\.\\(markdown\\|mdown\\|md\\)$" . markdown-mode)
  :commands gfm-view-mode
  :init
  (add-hook 'markdown-mode-hook 'visual-line-mode)
  (add-hook 'markdown-mode-hook 'flyspell-mode)
  :config
  (defun rasen/insert-timestamp ()
    "Insert current timestamp in ISO 8601 format"
    (interactive)
    (insert (format-time-string "%FT%R%z")))

  (general-def 'normal markdown-mode-map
    "'"      #'markdown-edit-code-block
    "C-c '"  (rasen/hard-way "'"))
  (general-def 'normal edit-indirect-mode-map
    "'"      #'edit-indirect-commit
    "C-c '"  (rasen/hard-way "'"))
  (general-def 'insert markdown-mode-map
    "C-c ,"  #'rasen/insert-timestamp)

  (setq markdown-fontify-code-blocks-natively t))
#+end_src

Package edit-indirect needed to edit code blocks.
#+begin_src emacs-lisp
(use-package edit-indirect
  :after markdown-mode)
#+end_src

**** Markdown cliplink
(Uses org-cliplink.)

#+begin_src emacs-lisp
(defun rasen/md-link-transformer (url title)
  (if title
      (format "[%s](%s)"
              (org-cliplink-elide-string
               (org-cliplink-escape-html4
                (org-cliplink-title-for-url url title))
               org-cliplink-max-length)
              url)
    (format "<%s>" url)))

(defun rasen/md-cliplink ()
  "Takes a URL from the clipboard and inserts an markdown-mode link
with the title of a page found by the URL into the current
buffer"
  (interactive)
  (org-cliplink-insert-transformed-title (org-cliplink-clipboard-content)
                                         #'rasen/md-link-transformer))
#+end_src
**** WriteGood
See http://bnbeckwith.com/code/writegood-mode.html

#+begin_src emacs-lisp
(use-package writegood-mode
  :hook (markdown-mode . writegood-mode))
#+end_src
*** JSON
#+begin_src emacs-lisp
(use-package json-mode
  :mode "\\.json$"
  :config
  (push '(json "https://github.com/tree-sitter/tree-sitter-json.git") treesit-language-source-alist))
#+end_src
*** YAML
#+begin_src emacs-lisp
(use-package yaml-mode
  :mode ("\\.\\(yml\\|yaml\\)$" . yaml-mode))
#+end_src
*** Jinja2
#+begin_src emacs-lisp
(use-package jinja2-mode
  :mode "\\.j2$")
#+end_src
*** Docker
(~<<nixos-section>>~)
#+name: nixos-section
#+begin_src nix
{
  virtualisation.docker.enable = true;
}
#+end_src

(emacs-lisp)
#+begin_src emacs-lisp
(use-package dockerfile-mode
  :mode "Dockerfile"
  :config
  (setq dockerfile-mode-command "env SUDO_ASKPASS=/usr/bin/ssh-askpass sudo -A docker"))
#+end_src
*** restclient
#+begin_src emacs-lisp
(use-package restclient
  :mode "\\.http$")
#+end_src
*** terraform
#+begin_src emacs-lisp
(use-package terraform-mode
  :mode "\\.tf$")
#+end_src
*** graphviz
#+begin_src emacs-lisp
(use-package graphviz-dot-mode
  :mode "\\.dot$"
  :config
  (setq graphviz-dot-view-command "dotty %s"))
#+end_src
*** protobuf
#+begin_src emacs-lisp
(use-package protobuf-mode
  :mode "\\.proto$")
#+end_src
*** SQL
#+begin_src emacs-lisp
(use-package sql
  :commands (sql-mode
             sql-connect
             sql-oracle
             sql-sybase
             sql-informix
             sql-sqlite
             sql-mysql
             sql-solid
             sql-ingres
             sql-ms
             sql-postgres
             sql-interbase
             sql-db2
             sql-linter
             sql-vertica)
  :config
  (add-hook 'sql-mode-hook (lambda () (toggle-truncate-lines t))))
#+end_src
*** PlantUML
Install plantuml.
#+name: home-manager-section
#+begin_src nix
{
  home.packages = [ pkgs.plantuml ];
}
#+end_src

Emacs configuration.
#+begin_src emacs-lisp
(use-package plantuml-mode
  :config
  :disabled t
  (setq plantuml-executable-path (executable-find "plantuml"))
  (setq plantuml-jar-path (expand-file-name "../lib/plantuml.jar" (file-name-directory (file-truename plantuml-executable-path))))
  (setq org-plantuml-jar-path plantuml-jar-path)

  (setq plantuml-default-exec-mode 'executable)
  (setq plantuml-exec-mode 'executable)

  (setenv "PLANTUML_LIMIT_SIZE" "8192")

  (add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
  (org-babel-do-load-languages 'org-babel-load-languages '((plantuml . t))))
#+end_src
*** COMMENT Common Lisp
Install SBCL.
#+name: home-manager-section
#+begin_src nix
{
  home.packages = [
    pkgs.sbcl
    # pkgs.clpm
  ];
}
#+end_src

#+begin_src emacs-lisp
(use-package slime
  :commands (slime)
  :config
  (setq inferior-lisp-program "sbcl"))
#+end_src
*** Zig
#+begin_src emacs-lisp
(use-package zig-mode
  :mode "\\.zig$"
  :config

  (el-patch-defun zig--run-cmd (cmd &optional source &rest args)
    "Use compile command to execute a zig CMD with ARGS if given.
If given a SOURCE, execute the CMD on it."
    (let ((cmd-args
           (if source
               (mapconcat 'shell-quote-argument (cons source args) " ")
             args)))
      (compile (concat zig-zig-bin " " cmd (el-patch-add " -target native-macos.11") " " cmd-args)))))
#+end_src
*** Swift
#+begin_src emacs-lisp
(use-package swift-mode
  :mode "\\.swift\\'"
  :interpreter "swift"
  :hook ((swift-mode) . eglot-ensure)
  :config
  (require 'eglot)
  (push '(swift-mode "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/sourcekit-lsp") eglot-server-programs))
#+end_src
*** Dart
#+begin_src emacs-lisp
(use-package dart-mode
  :mode "\\.dart\\'")
#+end_src
** GPT

#+begin_src emacs-lisp
(use-package gptel
  :commands (gptel gptel-send)
  :general
  ("s-g" #'gptel-send)
  :config
  (require 'gptel-curl)
  (require 'gptel-transient)
  (require 'password-store)
  (setq gptel-default-mode 'org-mode)
  (setq gptel-api-key (password-store-get "openai.com/emacs-api-key"))
  ;;(setq gptel-api-key #'(lambda () (password-store-get "openai.com/emacs-api-key")))

  (push '(thinking . "You are a thinking partner. Your goal is to challenge my ideas, provide supporting examples or counter-arguments, find inconsistencies, and links to other interesting ideas. Do not re-iterate my ideas. Respond concisely.") gptel-directives)

  (setq gptel-max-tokens 500)
  (gptel-make-gpt4all "GPT4All"           ;Name of your choosing
    :protocol "http"
    :host "localhost:4891"                 ;Where it's running
    :models '("Meta-Llama-3-8B-Instruct.Q4_0.gguf"
              "Nous-Hermes-2-Mistral-7B-DPO.Q4_0.gguf")))
#+end_src
* Look and Feel
** Remove the clutter
Hide menu, toolbar, scrollbar. (Goes to early-init to avoid flash of unstyled emacs.)
#+begin_src emacs-lisp :tangle .emacs.d/early-init.el
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

Do not show startup screen. (emacs-lisp)
#+begin_src emacs-lisp
(setq inhibit-startup-screen t)
#+end_src

Do not blink cursor. (emacs-lisp)
#+begin_src emacs-lisp
(blink-cursor-mode 0)
#+end_src

Draw block cursor as wide as the glyph under it.
For example, if a block cursor is over a tab, it will be drawn as wide as that tab on the display.
#+begin_src emacs-lisp
(setq-default x-stretch-cursor t)
#+end_src

Hightlight parentheses, show current column.
#+begin_src emacs-lisp
(show-paren-mode 1)
(column-number-mode 1)
#+end_src
** beacon-mode
Add a little bit of highlighting for the cursor when buffer scrolls or cursor jumps, so I don't lose it.
#+begin_src emacs-lisp
(use-package beacon
  :diminish beacon-mode
  :config

  ;; do not blink where beacon-mode plays badly
  (defun rasen/dont-blink-predicate ()
    (member major-mode '(notmuch-search-mode)))
  (add-hook 'beacon-dont-blink-predicates #'rasen/dont-blink-predicate)

  (beacon-mode 1))
#+end_src
