.emacs.d/early-init.el
(scroll-bar-mode -1)
