README.org
** Fonts
I'm not a font guru, so I just stuffed a bunch of random fonts in here.

#+name: nixos-section
#+begin_src nix
{
  fonts = {
    fontconfig.enable = true;
    fontDir.enable = true;
    enableGhostscriptFonts = false;

    packages = with pkgs; [
      pkgs.inconsolata
      pkgs.dejavu_fonts
      pkgs.source-code-pro
      pkgs.ubuntu_font_family
      pkgs.unifont
      pkgs.powerline-fonts
      pkgs.terminus_font
    ];
  };
}
#+end_src

For home-manager.
#+name: home-manager-section
#+begin_src nix
{
  fonts.fontconfig.enable = true;
  home.packages = [
    pkgs.iosevka
    pkgs.inconsolata
    pkgs.dejavu_fonts
    pkgs.source-code-pro
    pkgs.ubuntu_font_family
    pkgs.unifont
    pkgs.powerline-fonts
    pkgs.terminus_font
  ];
}
#+end_src

Configure fonts in Emacs. (~.emacs.d/early-init.el~)
#+begin_src emacs-lisp :tangle .emacs.d/early-init.el
(defun rasen/font-exists-p (font)
  "Check if the FONT exists."
  (and (display-graphic-p) (not (null (x-list-fonts font)))))

(defun rasen/set-my-fonts ()
  (let ((scale (if (eq system-type 'darwin) 2 1)))
    (cond
     ((rasen/font-exists-p "Iosevka")
      (set-face-attribute 'fixed-pitch nil :family "Iosevka" :height (* 80 scale) :width 'regular)
      (set-face-attribute 'default nil :family "Iosevka" :height (* 80 scale) :width 'regular))

     ((rasen/font-exists-p "IBM Plex Mono")
      (set-face-attribute 'fixed-pitch nil :family "IBM Plex Mono" :height 140)
      (set-face-attribute 'default nil :family "IBM Plex Mono" :height 140 :width 'regular))

     ((rasen/font-exists-p "Monaspace Neon")
      (set-face-attribute 'fixed-pitch nil :family "Monaspace Neon" :height 140 :width 'regular)
      (set-face-attribute 'default nil :family "Monaspace Neon" :height 140 :width 'regular))

     ((rasen/font-exists-p "Source Code Pro")
      (set-face-attribute 'fixed-pitch nil :family "Source Code Pro" :height 140 :width 'regular)
      (set-face-attribute 'default nil :family "Source Code Pro" :height 140))

     ((rasen/font-exists-p "Roboto Mono")
      (set-face-attribute 'fixed-pitch nil :family "Roboto Mono" :height 140)
      (set-face-attribute 'default nil :family "Roboto Mono" :height 140 :width 'regular))

     ((rasen/font-exists-p "DejaVu Sans Mono")
      (set-face-attribute 'fixed-pitch nil :family "DejaVu Sans Mono" :height 140)
      (set-face-attribute 'default nil :family "DejaVu Sans Mono" :height 140)))

    (cond
     ((and (eq system-type 'darwin)
           (rasen/font-exists-p "Linux Libertine O"))
      (set-face-attribute 'variable-pitch nil :family "Linux Libertine O" :height 180))

     ((rasen/font-exists-p "Linux Libertine O")
      (set-face-attribute 'variable-pitch nil :family "Linux Libertine O" :height 90))
     ((rasen/font-exists-p "Vollkorn")
      (set-face-attribute 'variable-pitch nil :family "Vollkorn" :height 80))
     ((rasen/font-exists-p "DejaVu Sans")
      (set-face-attribute 'variable-pitch nil :family "DejaVu Sans")))))

(rasen/set-my-fonts)
#+end_src

Apply my font settings when new frame is created (useful when emacs is started in daemon mode). (~.emacs.d/early-init.el~)
#+begin_src emacs-lisp :tangle .emacs.d/early-init.el
(defun rasen/font-hook (frame)
  (select-frame frame)
  (rasen/set-my-fonts))

(add-hook 'after-make-frame-functions #'rasen/font-hook)
#+end_src
** Variable-pitch fonts in org-mode
Use variable-pitch fonts in org-mode. (~<<org-config>>~)
#+name: org-config
#+begin_src emacs-lisp
(push "~/.emacs.d/site-lisp" load-path)
(require 'org-variable-pitch)
(setq org-variable-pitch-fixed-font "Iosevka")
(set-face-attribute 'org-variable-pitch-fixed-face nil
                    :inherit 'fixed-pitch)
(diminish 'org-variable-pitch-minor-mode)
(diminish 'buffer-face-mode)

;; Because asterisk in variable-pitch font is way too high, fontify
;; leading asterisks with fixed pitch face instead.
(setq org-variable-pitch-fontify-headline-prefix t)

;; remove org-table because valign-mode handles that
(delete 'org-table org-variable-pitch-fixed-faces)

(add-hook 'org-mode-hook #'org-variable-pitch-minor-mode)
#+end_src

Patch adaptive-wrap, so it work better with org-variable-pitch-mode (i.e., make adaptive prefix fixed-pitch).
#+begin_src emacs-lisp
(el-patch-defun adaptive-wrap-prefix-function (beg end)
  "Indent the region between BEG and END with adaptive filling."
  ;; Any change at the beginning of a line might change its wrap prefix, which
  ;; affects the whole line.  So we need to "round-up" `end' to the nearest end
  ;; of line.  We do the same with `beg' although it's probably not needed.
  (goto-char end)
  (unless (bolp) (forward-line 1))
  (setq end (point))
  (goto-char beg)
  (forward-line 0)
  (setq beg (point))
  (while (< (point) end)
    (let ((lbp (point)))
      (put-text-property
       (point) (progn (search-forward "\n" end 'move) (point))
       'wrap-prefix
       (let ((pfx (adaptive-wrap-fill-context-prefix
                   lbp (point))))
         ;; Remove any `wrap-prefix' property that
         ;; might have been added earlier.
         ;; Otherwise, we end up with a string
         ;; containing a `wrap-prefix' string
         ;; containing a `wrap-prefix' string ...
         (remove-text-properties
          0 (length pfx) '(wrap-prefix) pfx)
         (let ((dp (get-text-property 0 'display pfx)))
           (when (and dp (eq dp (get-text-property (1- lbp) 'display)))
             ;; There's a `display' property which covers not just the
             ;; prefix but also the previous newline.  So it's not just making
             ;; the prefix more pretty and could interfere or even defeat our
             ;; efforts (e.g. it comes from `visual-fill-mode').
             (remove-text-properties
              0 (length pfx) '(display) pfx)))

         (el-patch-add
           (add-face-text-property 0 (length pfx) 'org-variable-pitch-fixed-face nil pfx))

         pfx))))
  `(jit-lock-bounds ,beg . ,end))
#+end_src
*** Align org-mode tables with variable-pitch fonts
#+begin_src emacs-lisp
(use-package valign
  :hook
  (org-mode . valign-mode)
  :config
  (setq valign-fancy-bar t))
#+end_src
** Hi-DPI
These are for omicron-only.

#+name: home-manager-section
#+begin_src nix
{
  xresources.properties = {
    "Xft.dpi" = 276;
    "Xcursor.size" = 64;
  };
}
#+end_src

#+name: machine-omicron
#+begin_src nix
{
  console.packages = [
    pkgs.terminus_font
  ];
  console.font = "ter-132n";
}
#+end_src

Load console configuration early at initrd. This ensures the proper font (sizes) are loaded when asking for disk encryption passphrase.
#+name: nixos-section
#+begin_src nix
{
  console.earlySetup = true;
}
#+end_src

#+name: machine-omicron
#+begin_src nix
{
  services.xserver.dpi = 276;
}
#+end_src
** Color theme
I use [[https://gitlab.com/protesilaos/modus-themes][modus-operandi]] theme. (Goes to early-init to avoid flash of unstyled emacs.)
#+begin_src emacs-lisp :tangle .emacs.d/early-init.el
(require 'modus-themes)
(require 'modus-operandi-theme)
(require 'modus-vivendi-theme)

(setq modus-themes-italic-constructs t)
(setq modus-themes-bold-constructs t)

;; Use proportional fonts only when I explicitly configure them.
(setq modus-themes-no-mixed-fonts t)

(setq modus-themes-links '(faint background no-underline))
(setq modus-themes-org-agenda
      '((header-date . (workaholic bold-all))
        (scheduled . uniform)))

(load-theme 'modus-operandi t)

(modus-themes-with-colors
  (let ((custom--inhibit-theme-enable nil))
    (custom-theme-set-faces
     'modus-operandi

     `(rasen/org-project-face ((t :weight bold :background ,bg-dim)))

     `(rasen/agenda-date-header ((t :weight bold :foreground ,fg-dim)))

     `(fringe ((,c (:background ,bg-main :foreground ,fg-main))))

     ;; custom colors for vterm
     `(vterm-color-default ((,c (:background ,bg-main :foreground ,fg-main))))
     `(vterm-color-black ((,c (:background "#000" :foreground "#000"))))
     `(vterm-color-white ((,c (:background "#fff" :foreground "#fff"))))
     `(vterm-color-red ((,c (:background ,bg-red-intense :foreground ,red))))
     `(vterm-color-green ((,c (:background ,bg-green-intense :foreground ,green))))
     `(vterm-color-yellow ((,c (:background ,bg-yellow-intense :foreground ,yellow))))
     `(vterm-color-blue ((,c (:background ,bg-blue-intense :foreground ,blue))))
     `(vterm-color-magenta ((,c (:background ,bg-magenta-intense :foreground ,magenta))))
     `(vterm-color-cyan ((,c (:background ,bg-cyan-intense :foreground ,cyan))))

     ;; do not bold matches (this makes text jiggle with variable-pitch fonts)
     `(isearch ((,c (:inherit modus-themes-search-success))))
     `(query-replace ((,c :inherit modus-theme-intense-yellow)))

     ;; `(org-level-1 ((,c :inherit modus-themes-heading-1 :height 1.2 :background ,bg-cyan-subtle)))

     ;; Make TODOs bold
     `(org-todo ((,c :foreground ,magenta-warmer
                     :weight bold)))
     ;; `(org-table ((,c (:foreground ,fg-special-cold :inherit nil))))

     ;; Make tags stand out
     ;; `(org-tag ((,c :weight bold :foreground nil :background nil)))

     ;; dim done items
     `(org-done ((,c :foreground ,fg-alt)))
     `(org-headline-done ((,c :foreground ,fg-alt)))
     `(org-agenda-calendar-event ((,c))) ;; plain black is fine
     `(org-agenda-done ((,c :foreground ,fg-alt)))
     ;; remove special background from archived items
     `(org-archived ((,c (:foreground ,fg-alt))))

     `(org-link ((,c :foreground ,blue-warmer :background ,bg-dim :underline nil :inherit link)))
     `(rasen/org-id-link ((,c :foreground ,green-warmer :inherit org-link)))
     ))

  (setq org-todo-keyword-faces
        `(("TODO"     . (:foreground ,blue-intense :inherit fixed-pitch))
          ("NEXT"     . (:foreground ,red-intense  :inherit fixed-pitch))
          ("BUILD"    . (:foreground ,red-intense  :inherit fixed-pitch))
          ("WAIT"     . (:foreground ,magenta-warmer  :inherit fixed-pitch))
          ("DONE"     . (:foreground ,fg-dim       :inherit fixed-pitch))
          ("CANCELED" . (:foreground ,fg-dim       :inherit fixed-pitch)))))
#+end_src
** Auto-dark mode
#+begin_src emacs-lisp
(defun my/load-theme (appearance)
  (pcase appearance
    ('light (load-theme 'modus-operandi t))
    ('dark (load-theme 'modus-vivendi t))))

(add-hook 'ns-system-appearance-change-functions #'my/load-theme)
#+end_src
